<a href="https://colab.research.google.com/github/SSUMINIs/mulcam34/blob/main/pandas_file_240105.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
## 파일 입출력
- read_csv() : https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html
- 그 외 파일 형식 불러오기 자료 : https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

DATA_PATH = 'playground-series-s4e1/'

train = pd.read_csv(DATA_PATH + 'train.csv')
test = pd.read_csv(DATA_PATH + 'test.csv')
submission = pd.read_csv(DATA_PATH +'sample_submission.csv')

In [ ]:
# 파일내보내기
result = train.loc[:,['id','Age']]
result.to_csv("result.csv", index = False) #index = False시, index번호는 열로 추출 안함
#현재 파일과 동일한 곳에 파일내보내기 됨.
#play~ 안에 넣고 싶으면 DATA_PATH +"result.csv"

In [ ]:
#pandas tutorials연습 _How to manipulate textual data

In [ ]:
titanic = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv")
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [ ]:
titanic['Name'].str.lower().head()

0                              braund, mr. owen harris
1    cumings, mrs. john bradley (florence briggs th...
2                               heikkinen, miss. laina
3         futrelle, mrs. jacques heath (lily may peel)
4                             allen, mr. william henry
Name: Name, dtype: object

In [ ]:
titanic['Name'].str.split(",")

0                             [Braund, Mr. Ow, n Harris]
1      [Cumings, Mrs. John Bradl, y (Flor, nc,  Brigg...
2                             [H, ikkin, n, Miss. Laina]
3      [Futr, ll, , Mrs. Jacqu, s H, ath (Lily May P,...
4                           [All, n, Mr. William H, nry]
                             ...
886                             [Montvila, R, v. Juozas]
887                      [Graham, Miss. Margar, t Edith]
888      [Johnston, Miss. Cath, rin,  H, l, n "Carri, "]
889                            [B, hr, Mr. Karl How, ll]
890                               [Dool, y, Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [ ]:
titanic['Surname'] = titanic['Name'].str.split(",").str.get(0)
titanic['Surname']

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Surname, Length: 891, dtype: object

In [ ]:
titanic["Name"].str.contains("Countess")

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [ ]:
titanic[titanic["Name"].str.contains("Countess")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,Rothes

In [ ]:
titanic[titanic["Name"].str.lower().str.contains("countess")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,Rothes

In [ ]:
titanic["Name"].str.len().idxmax()

307

In [ ]:
titanic.loc[titanic["Name"].str.len().idxmax(), "Name"]

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [ ]:
titanic['Sex_short'] = titanic["Sex"].replace({"male":"M","female":"F"})
titanic['Sex_short']

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex_short, Length: 891, dtype: object